{
  "english": [
    { "id": "HighTitle", "text": "Where I am the most comfortable."},
	{ "id": "UETitle", "text": "Unreal Engine"},
    { "id": "UEContent", "text": "Understanding of the engine and the tools provided. Use of Perforce and Github for version control, and some knowledge of Wwise for sound management." },
	{ "id": "UnityTitle", "text": "Unity" },
    { "id": "UnityContent", "text": "Understanding of the engine and the provided tools. Use of Perforce and Github for version control." },
	{ "id": "IATitle", "text": "AI" },
    { "id": "IAContent", "text": "Implementation of a FSM, pathfinding, AI's view and hearing management." },
	{ "id": "ToolsTitle", "text": "Tools" },
	{ "id": "ToolsContent", "text": "Creation of tools and deployment of a tool on engines or on a desktop application via WPF. Performance testing for algorithms and creation of a toolbox for engines." },
	{ "id": "ProjectManageTitle", "text": "Project Management" },
	{ "id": "ProjectManageContent", "text": "Distribution and organization of tasks through Trello, collaborative work on Perforce or Github. Leading a team of human size and brainstorming in group." },
	{ "id": "UMLTitle", "text": "Programming Architecture Design" },
	{ "id": "UMLContent", "text": "Understanding and implementation of a UML diagram. Regular use of StarUML and collaboration on Miro." },
	{ "id": "FrenchTitle", "text": "Français" },
	{ "id": "FrenchContent", "text": "Mother tongue language, no difficulties at all in order to write, speak or understand others." },
	{ "id": "MediumTitle", "text": "Where I am competent" },
	{ "id": "3CTitle", "text": "3C"},
    { "id": "3CContent", "text": "Customizable 3C, suitable for all types of games. Implementation of smart cam and IK on humanoid characters." },
	{ "id": "ARTitle", "text": "Augmented Reality" },
    { "id": "ARContent", "text": "Development of AR project with ARCore. Knowledge and application of Unity's AR kit in addition to ARCore." },
	{ "id": "AndroidTitle", "text": "Android" },
    { "id": "AndroidContent", "text": "Development of mobile applications for Android devices and debugging on various devices. Deployment on the Google Play Store." },
	{ "id": "UITitle", "text": "User interface" },
	{ "id": "UIContent", "text": "Creation of simple interfaces and linking with game elements. Key mapping interface, accessibility options and possibility to save these settings." },
	{ "id": "EnglishTitle", "text": "Anglais" },
	{ "id": "EnglishContent", "text": "Advanced level in understanding texts and writing, a bit of difficulies in speaking and understanding people." },
	{ "id": "LowTitle", "text": "Additionals" },
	{ "id": "VRTitle", "text": "Virtual Reality" },
	{ "id": "VRContent", "text": "Development of a VR project and addition of support to an existing project (on Unity)." },
	{ "id": "BlenderTitle", "text": "Blender" },
	{ "id": "BlenderContent", "text": "Basic knowledge in modeling, rigging, and animation. Creation of simple models and export and import on Unreal and Unity." },
	{ "id": "WebTitle", "text": "Web" },
	{ "id": "WebContent", "text": "Mastery of HTML5 and CSS3. Some knowledge in PHP, JavaScript, and SQL. Use of React and JSX syntax. Responsive site creation." },
	{ "id": "GermanTitle", "text": "Allemand" },
	{ "id": "GermanContent", "text": "Intermediate level in writing, with a more modest level in speaking." }
  ],
  "french": [
    { "id": "HighTitle", "text": "Là où je suis le plus à l'aise" },
	{ "id": "UETitle", "text": "Unreal Engine"},
    { "id": "UEContent", "text": "Compréhension du moteur et des outils fournis. Utilisation de Perforce et Github pour le version control, et quelques connaissances sur Wwise pour la gestion des sons." },
	{ "id": "UnityTitle", "text": "Unity" },
    { "id": "UnityContent", "text": "Compréhension du moteur et des outils fournis. Utilisation de Perforce et Github pour le version control." },
	{ "id": "IATitle", "text": "IA" },
    { "id": "IAContent", "text": "Implémentation d'une FSM, pathfinding, gestion de la vue et de l'ouie d'une IA." },
	{ "id": "ToolsTitle", "text": "Outils" },
	{ "id": "ToolsContent", "text": "Création d'outils et déploiement d'un outil sur les moteurs ou sur une application bureautique via WPF. Test de performance pour les algorithmes et création d'une toolbox pour les moteurs." },
	{ "id": "ProjectManageTitle", "text": "Gestion de projet" },
	{ "id": "ProjectManageContent", "text": "Répartition et organisation des tâches via Trello, travail collaboratif sur Perforce ou Github. Direction d'une équipe à taille humaine et brainstorming en groupe." },
	{ "id": "UMLTitle", "text": "Conception d'architecture de programmation" },
	{ "id": "UMLContent", "text": "Compréhension et réalisation d'un diagramme UML. Utilisation régulière de StarUML, collaboration sur Miro." },
	{ "id": "FrenchTitle", "text": "Français" },
	{ "id": "FrenchContent", "text": "Langue maternelle, aucune difficulté, aussi bien à l'écrit qu'à l'oral." },
	{ "id": "MediumTitle", "text": "Les domaines où je suis compétent" },
	{ "id": "3CTitle", "text": "3C"},
    { "id": "3CContent", "text": "Création de 3C personnalisable, adapté à tout type de jeux. Implémentation de smart cam et d'IK sur des personnages humanoïdes." },
	{ "id": "ARTitle", "text": "Réalité augmentée" },
    { "id": "ARContent", "text": "Développement de projet en RA avec ARCore. Connaisances et application du kit AR de Unity en supplément d'ARCore." },
	{ "id": "AndroidTitle", "text": "Android" },
    { "id": "AndroidContent", "text": "Développement d'une application mobile à destination des appareils android et débogage sur divers appareils. Déploiement sur le Google PlayStore." },
	{ "id": "UITitle", "text": "Interface utilisateur" },
	{ "id": "UIContent", "text": "Création d'interfaces simples et liaison avec les éléments de jeu. Interface de mapping des touches, options d'accessibilité et sauvegarde de ces paramètres." },
	{ "id": "EnglishTitle", "text": "Anglais" },
	{ "id": "EnglishContent", "text": "Compréhension et expression écrite niveau C1, un peu plus de difficultés à la compréhension orale mais je m'en sors bien." },
	{ "id": "LowTitle", "text": "Les petits plus" },
	{ "id": "VRTitle", "text": "Réalité virtuelle" },
	{ "id": "VRContent", "text": "Création d'un projet VR et ajout d'un support à un projet existant (sur Unity)." },
	{ "id": "BlenderTitle", "text": "Blender" },
	{ "id": "BlenderContent", "text": "Connaissances basique en modélisation, rig, et animation. Réalisation de modèles simples et exportation puis importation sur Unreal et Unity." },
	{ "id": "WebTitle", "text": "Web" },
	{ "id": "WebContent", "text": "Maîtrise de l'HTML5 et CSS3. Quelques connaissances en PHP, JavaScript, et SQL. Utilisation de React et de la syntaxe JSX. Création de site responsive." },
	{ "id": "GermanTitle", "text": "Allemand" },
	{ "id": "GermanContent", "text": "Niveau B1-B2 à l'écrit, avec un niveau plus modeste à l'oral." }
  ]
}